{"posts":[{"title":"","text":"♬月火水木金土日♬♬毎日が Workday♬Hi, 我是MahiroshiI am currently a final-year undergraduate student at Nanyang Technological University, majoring in Computer Science. My FYP Topic is multimodal LLM for drugs.Before that, I join the MAVIT LAB as Professional Internship, DPNM lab during Postech Summer Program and S-Lab for Advanced Intelligence as student assistant.I am looking the chance for Graduate or Jobs, you can view my CV here.我同时是一个小小的b站up主,如果小哥同样是偶像宅或者对IT感兴趣,欢迎来二偶女声优痴IT佬交流群 宣传NOVELM@STER NG 筹备中","link":"/2099/07/21/hello-world/"},{"title":"","text":"Old-blog, you can find some article about AI vtuber and Live2d here","link":"/2025/07/21/archive/"}],"tags":[],"categories":[{"name":"Bib","slug":"Bib","link":"/categories/Bib/"}],"pages":[{"title":"","text":"图片资源文件夹这个文件夹用于存放网站的静态图片资源。 当前需要的文件： 头像图片：H3f_vRj7_400x400.jpg 请将你的头像文件复制到这个文件夹中 配置文件中已设置为：/img/H3f_vRj7_400x400.jpg 其他可选图片： logo.svg - 网站 Logo favicon.svg - 网站图标 og_image.png - 社交媒体分享图片 使用方法：在 Markdown 文件中引用图片： 1![描述](/img/图片名称.jpg) 在配置文件中引用图片： 1avatar: /img/H3f_vRj7_400x400.jpg","link":"/img/README.html"},{"title":"","text":"About Me 中文简历ResearchCurrently working on several exciting projects: Multimodal LLM for lung cancer diagnosis in collaboration with Guangzhou Medical University AI-powered depression detection using brain fMRI scans and psychological evaluations Recent Publications Zhang, J., Tian Y. DiffiT-HSFDA: A Diffusion Vision Transformers for Source-Free Domain Adaptation in Histology (ICIC 2025) DOI: 10.1007/978-981-95-0030-7_2 Zhang, C., Wang, X., Zhang, J. et al. VESC: a new variational autoencoder based model for anomaly detection (International Journal of Machine Learning and Cybernetics) DOI: 10.1007/s13042-022-01657-w Zhang, C., Wang, X., Zhang, H.,Zhang, J. et al. LayerLog: Log sequence anomaly detection based on hierarchical semantics (Applied Soft Computing) DOI: 10.1016/j.asoc.2022.109860 Work ExperienceResearch Assistant @ NTU Lee Kong Chian School of Medicine MAVIT Lab (Aug 2024 - Present) Developing a source-free domain-adaptive framework based on Transformers, and diffusion models for lung cancer classification and weakly supervised localization in histopathological images. Collaborating with Guangzhou Medical University on lung cancer research Research Intern @ Pohang University of Science and Technology (Jun 2024 - Aug 2024) Worked on MRI/X-ray image segmentation for spine disease diagnosis Applied denoising diffusion models and NLP techniques for medical data analysis Full Stack Developer Intern @ Clangorous Technological Company (Dec 2023 - Feb 2024) Developed applications using .NET, MVC, and ERP systems Contributed to full-stack development and testing SkillsAI/ML: PyTorch, Computer Vision, Transformers, Domain Adaptation, Multimodal LearningProgramming: Python, C/C++, JavaWeb Development: Flask, Vue, React, MySQL, .NETTools: Data preprocessing, Web scraping, Unity","link":"/about/index.html"},{"title":"简历-中文","text":"个人简历张家华 | 邮箱：Jzhang132@e.ntu.edu.sg | https://mahiruoshi.github.io 教育背景南洋理工大学，新加坡 | 2022年8月 - 至今计算机与数据科学学院计算机科学工学学士学位(四年级) 已发表论文Zhang, J., Tian Y. DiffiT-HSFDA: A Diffusion Vision Transformers for Source-Free Domain Adaptation in Histology [ICIC 2025] https://link.springer.com/chapter/10.1007/978-981-95-0030-7_26 Zhang, C., Wang, X., Zhang, J. et al. VESC: a new variational autoencoder based model for anomaly detection. Int. J. Mach. Learn. &amp; Cyber. 14, 683–696 (2023). https://doi.org/10.1007/s13042-022-01657-w Zhang, C., Wang, X., Zhang, H., Zhang, J., Zhang, H., Liu, C., &amp; Han, P. LayerLog: Log sequence anomaly detection based on hierarchical semantics. Applied Soft Computing (2022). https://doi.org/10.1016/j.asoc.2022.109860 实习广州医科大学 – 移植科 | 实验员-劳务（技术总架构） | 2024年6月 - 至今南洋理工大学李光前医学院MAVIT实验室 – 杨思勇助理教授 | 专业实习 | 2024年12月 - 2025年6月广州医科大学 – 胸外科 | 实验员-劳务（技术-域适应） | 2024年8月 - 至今浦项科技大学 - DPNM实验室 – 洪元基教授 | PSP项目暑期实习生 | 2024年6月 - 2024年8月南洋理工大学 - S-Lab先进智能实验室 | 学生助理 | 2024年3月 - 2024年6月深圳乐虾科技公司 | 全栈工程师实习 | 2023年12月 - 2024年2月 研究项目简介整合多组学标志物以优化肺移植受者的预后预测 | 2025年5月 - 至今由何建行教授以及梁景皓博士牵头，我正在参与一个多中心回顾性队列研究。项目组的主要成员是广州医科大学的研究生以及我，其中我负责核心技术架构以及相关的训练工作。具体而言，面对肺移植相关的挑战，我们设计了一个基于大模型建模的多模态知识图谱以及相关的图神经网络预测方法。目前模型已经在主要中心取得了良好的效果（500例患者的C index＞0.75），我们正在进行多中心的外部验证，预期在年底或2026年发布我们的研究成果。 肺部肿瘤手术中冰冻切片快速诊断的应用研究 | 2024年8月 - 至今与广州医科大学胸外科部门合作，我在针对肺癌组织病理学图像的视觉基础模型项目中负责域迁移部分的研究。我的主要研究挑战是染色方式变化的跨域迁移场景下，弱监督分割算法面对的ROI激活问题。在早期的研究中（已被ICIC2025录用），我们提出了一套基于扩散的无源域适应流程，实现了高准确度的分割性能。在进一步的研究中，我通过在CAM算法内引入MAE机制，实现了进一步的性能提升以及在更多WSOL和癌症WSI图像下的应用，目前研究成果已经提交至WACV2026。 多模态大语言模型在医学场景下的应用 | 2024年2月 - 至今这是我毕业设计以及专业实习的主题，我正在开发一个LLaVA风格的多模态模型，使大语言模型能够通过基于图的表征和上下文学习理解高维医疗影像。这种方法消除了大量微调的需求，并且利用提示工程和情景学习来解决专家小模型泛化能力有限的问题，在临床环境中支持无感知用户体验，同时保持预测的高准确性。该方法在组织病理学以及fMRI模态上实现了不亚于迁移学习的性能，初步研究已被PRIME-MICCAI录用，我正在继续推进其作为我的毕业设计，并且计划在会议现场分享更多发现。 过往项目简介移动应用医学图像分割以及边缘计算临床数据分析：在浦项科技大学的暑期项目中，我设计了一个基于卷积网络的扩散去噪流程，用于MRI/X光图像分割和脊柱疾病诊断分类工作，在BUU和腰椎MRI数据集上提升了性能。在后续研究中，我应用特征学习和自然语言处理技术分析医院主诉，评估聚类模型和TF-IDF等向量化方法，开发了针对边缘计算环境优化的轻量级算法，用户对系统存在的感知最小。 视频质量增强：在S-Lab的实习中，我通过应用噪声检测算法和性能评估基准标签预处理技术，改善了AI生成视频的视频质量。 为大语言模型集成TTS API：我开发并发布了一个GitHub仓库，将VITS语音合成API与包括ChatGPT在内的大语言模型集成，在视频制作和直播应用的内容创作者中获得了广泛应用：https://github.com/Paraworks/vits_with_chatgpt-gpt3 部署在Hugging Face的在线TTS推理网站：我使用Hugging Face容器构建并部署了面向在线视频制作者的语音合成推理平台：https://huggingface.co/spaces/Mahiruoshi/BangDream-Bert-VITS2 研究兴趣与技能研究兴趣：多模态机器学习、域适应与迁移学习、计算机视觉与图像处理、提示工程、情景学习、图神经网络、无监督学习与数据挖掘 技术技能： PyTorch及相关计算机视觉、变换器、几何、音频处理工具包 使用大型集群服务器进行大模型开发 全栈软件和网站开发：Jinja2、Flask、.NET、ABP、Vue、React、MySQL、Android开发、Unity 数据获取、数据预处理、网络爬虫技术 课外学习加州大学洛杉矶分校 | 2023年6月 - 8月夏季交流项目全球交流模块（GEM），道德哲学 大规模开放在线课程MIT教授：Path Academics机器学习在线研究研讨会Coursera历史学、语言学、哲学和精神分析课程 南洋理工大学IET俱乐部（工程技术学会） | 2022年8月 - 2023年5月活动经理为IET会员和南洋理工大学学生组织IT导向的活动和竞赛","link":"/about/bib.html"}]}