{"posts":[{"title":"","text":"♬月火水木金土日♬♬毎日が Workday♬Hi, 我是MahiroshiI am currently a final-year undergraduate student at Nanyang Technological University, majoring in Computer Science. My FYP Topic is multimodal LLM for drugs.Before that, I join the MAVIT LAB as Professional Internship, DPNM lab during Postech Summer Program and S-Lab for Advanced Intelligence as student assistant.I am looking the chance for Graduate or Jobs, you can view my CV here.我同时是一个小小的b站up主,如果小哥同样是偶像宅或者对IT感兴趣,欢迎来二偶女声优痴IT佬交流群 宣传NOVELM@STER NG 筹备中","link":"/2099/07/21/hello-world/"},{"title":"","text":"Old-blog, you can find some article about AI vtuber and Live2d here","link":"/2025/07/21/archive/"}],"tags":[],"categories":[{"name":"Bib","slug":"Bib","link":"/categories/Bib/"}],"pages":[{"title":"","text":"About MeResearchCurrently working on several exciting projects: Multimodal LLM for lung cancer diagnosis in collaboration with Guangzhou Medical University AI-powered depression detection using brain fMRI scans and psychological evaluations Recent Publications Zhang, J., Tian Y. DiffiT-HSFDA: A Diffusion Vision Transformers for Source-Free Domain Adaptation in Histology (ICIC 2025, LNCS/LNBI 15867) DOI: 10.1007/978-981-95-0030-7_2 Zhang, C., Wang, X., Zhang, J. et al. VESC: a new variational autoencoder based model for anomaly detection (Int. J. Mach. Learn. &amp; Cyber., 2023) DOI: 10.1007/s13042-022-01657-w Zhang, C., Wang, X., Zhang, H.,Zhang, J. et al. LayerLog: Log sequence anomaly detection based on hierarchical semantics (Applied Soft Computing, 2022) DOI: 10.1016/j.asoc.2022.109860 Work ExperienceResearch Assistant @ NTU Lee Kong Chian School of Medicine MAVIT Lab (Aug 2024 - Present) Developing a source-free domain-adaptive framework based on Transformers, and diffusion models for lung cancer classification and weakly supervised localization in histopathological images. Collaborating with Guangzhou Medical University on lung cancer research Research Intern @ Pohang University of Science and Technology (Jun 2024 - Aug 2024) Worked on MRI/X-ray image segmentation for spine disease diagnosis Applied denoising diffusion models and NLP techniques for medical data analysis Full Stack Developer Intern @ Clangorous Technological Company (Dec 2023 - Feb 2024) Developed applications using .NET, MVC, and ERP systems Contributed to full-stack development and testing SkillsAI/ML: PyTorch, Computer Vision, Transformers, Domain Adaptation, Multimodal LearningProgramming: Python, C/C++, JavaWeb Development: Flask, Vue, React, MySQL, .NETTools: Data preprocessing, Web scraping, Unity","link":"/about/index.html"},{"title":"","text":"图片资源文件夹这个文件夹用于存放网站的静态图片资源。 当前需要的文件： 头像图片：H3f_vRj7_400x400.jpg 请将你的头像文件复制到这个文件夹中 配置文件中已设置为：/img/H3f_vRj7_400x400.jpg 其他可选图片： logo.svg - 网站 Logo favicon.svg - 网站图标 og_image.png - 社交媒体分享图片 使用方法：在 Markdown 文件中引用图片： 1![描述](/img/图片名称.jpg) 在配置文件中引用图片： 1avatar: /img/H3f_vRj7_400x400.jpg","link":"/img/README.html"}]}